In [3]:
import numpy as np

In [4]:
import pandas as pd

In [9]:
labels= ['a', 'b', 'c']
my_data=[10,20,30]
arr=np.array(my_data)
d= {'a':10,'b':20, 'c':30}

In [10]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [11]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [15]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [18]:
ser1=pd.Series([1,2,3,4],['USA', 'Germany', 'USSR', 'Japan'])

In [19]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [21]:
from numpy.random import randn

In [23]:
np.random.seed(101)

In [26]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E,'], ['W','X','Y','Z'])

In [31]:
df['W']

A     0.302665
B    -0.134841
C     0.807706
D    -0.497104
E,   -0.116773
Name: W, dtype: float64

In [36]:
df[['W','Z']]

           W         Z
A   0.302665 -1.159119
B  -0.134841  0.184502
C   0.807706  0.329646
D  -0.497104  0.484752
E, -0.116773  1.996652

In [38]:
#creating a new column
df['new'] = df['W']+df['Y']

In [40]:
df

           W         X         Y         Z       new
A   0.302665  1.693723 -1.706086 -1.159119 -1.403420
B  -0.134841  0.390528  0.166905  0.184502  0.032064
C   0.807706  0.072960  0.638787  0.329646  1.446493
D  -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E, -0.116773  1.901755  0.238127  1.996652  0.121354

In [42]:
df.drop('new',axis=1,inplace=True)

In [43]:
df

           W         X         Y         Z
A   0.302665  1.693723 -1.706086 -1.159119
B  -0.134841  0.390528  0.166905  0.184502
C   0.807706  0.072960  0.638787  0.329646
D  -0.497104 -0.754070 -0.943406  0.484752
E, -0.116773  1.901755  0.238127  1.996652

In [47]:
#seeing the shape in tuples 
#(rows, columns)
df.shape

(5, 4)

In [51]:
df[['Y','X']]

           Y         X
A  -1.706086  1.693723
B   0.166905  0.390528
C   0.638787  0.072960
D  -0.943406 -0.754070
E,  0.238127  1.901755

In [52]:
df

           W         X         Y         Z
A   0.302665  1.693723 -1.706086 -1.159119
B  -0.134841  0.390528  0.166905  0.184502
C   0.807706  0.072960  0.638787  0.329646
D  -0.497104 -0.754070 -0.943406  0.484752
E, -0.116773  1.901755  0.238127  1.996652

In [53]:
#location based indexed
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [55]:
#numerical based index
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [56]:
df.loc['B','Y']

0.16690463609281317

In [57]:
#subsections
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [58]:
#conditional selection
df > 0

        W      X      Y      Z
A    True   True  False  False
B   False   True   True   True
C    True   True   True   True
D   False  False  False   True
E,  False   True   True   True

In [60]:
booldf = df > 0

In [61]:
df[booldf]

           W         X         Y         Z
A   0.302665  1.693723       NaN       NaN
B        NaN  0.390528  0.166905  0.184502
C   0.807706  0.072960  0.638787  0.329646
D        NaN       NaN       NaN  0.484752
E,       NaN  1.901755  0.238127  1.996652

In [62]:
df[df>0]

           W         X         Y         Z
A   0.302665  1.693723       NaN       NaN
B        NaN  0.390528  0.166905  0.184502
C   0.807706  0.072960  0.638787  0.329646
D        NaN       NaN       NaN  0.484752
E,       NaN  1.901755  0.238127  1.996652

In [63]:
df

           W         X         Y         Z
A   0.302665  1.693723 -1.706086 -1.159119
B  -0.134841  0.390528  0.166905  0.184502
C   0.807706  0.072960  0.638787  0.329646
D  -0.497104 -0.754070 -0.943406  0.484752
E, -0.116773  1.901755  0.238127  1.996652

In [64]:
df['W']>0

A      True
B     False
C      True
D     False
E,    False
Name: W, dtype: bool

In [65]:
df['W']

A     0.302665
B    -0.134841
C     0.807706
D    -0.497104
E,   -0.116773
Name: W, dtype: float64

In [67]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [68]:
#grab all the rows in data frame where 
#all the rows are less than 0
df[df['Z']<0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [75]:
df[df['W']>0][['X','Y']]

          X         Y
A  1.693723 -1.706086
C  0.072960  0.638787

In [93]:
#multiple conditions
df[(df['W']>0) & (df['Y']>0)]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [94]:
#how to reset the index to a numerical index
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4    E, -0.116773  1.901755  0.238127  1.996652

In [95]:
#new index, settin index
newind='CA NY WY OR CO'.split()

In [96]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [97]:
df['States']=newind

In [100]:
df.set_index('States',inplace=True)

In [101]:
df

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652